# EndConnectorIndex Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropItem..::..EndConnectorIndex Property
PipeFittingAndAccessoryPressureDropItem Class See Also
---
The index of the end conector of the flow path
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int EndConnectorIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndConnectorIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int EndConnectorIndex {
	int get ();
}
```

# See Also
PipeFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Plumbing Namespace